Revit 2026 API

# IFCAggregateAddAggregate Method

---

Creates a nested aggregate and adds it to the aggregate.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCAggregate AddAggregate()
```
```vb
Public Function AddAggregate As IFCAggregate
```
```cpp
public:
IFCAggregate^ AddAggregate()
```
```fsharp
member AddAggregate : unit -> IFCAggregate
```

#### Return Value

IFCAggregate The nested aggregate.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The aggregate is not valid. |

#### Reference

IFCAggregate Class

Autodesk.Revit.DB.IFC Namespace